       identification division.
       program-id. COBOLTEM00.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.

           goback.
           
       end program COBOLTEM00.